Revit 2027 API
BuiltInFailures.TrussFailures.IncorrectWallUsageWithAttachedStruct Property
 A structural framing element is attached to a wall whose Structural Usage is set to [Usage].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IncorrectWallUsageWithAttachedStruct { get; }
Public Shared ReadOnly Property IncorrectWallUsageWithAttachedStruct As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IncorrectWallUsageWithAttachedStruct {
	FailureDefinitionId^ get ();
}
static member IncorrectWallUsageWithAttachedStruct : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace